<a href="https://colab.research.google.com/github/AkankshaB123/leet-code/blob/main/Top_X_.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import sqlite3
import pandas as pd

# -----------------------------
# Create in-memory database
# -----------------------------
conn = sqlite3.connect(":memory:")

# Create customers table
conn.execute("""
CREATE TABLE customers (
    customer_id INTEGER,
    customer_name TEXT,
    spending INTEGER
)
""")

# Insert 30 customers (so top 10% = 3 records)
customers = [
    (1, "Alice", 900),
    (2, "Bob", 850),
    (3, "Carol", 800),
    (4, "David", 780),
    (5, "Eva", 760),
    (6, "Frank", 740),
    (7, "Grace", 720),
    (8, "Henry", 700),
    (9, "Ivy", 680),
    (10, "Jack", 660),
    (11, "Kara", 640),
    (12, "Leo", 620),
    (13, "Mia", 600),
    (14, "Nina", 580),
    (15, "Oscar", 560),
    (16, "Paul", 540),
    (17, "Quinn", 520),
    (18, "Rita", 500),
    (19, "Sam", 480),
    (20, "Tina", 460),
    (21, "Uma", 440),
    (22, "Victor", 420),
    (23, "Wendy", 400),
    (24, "Xavier", 380),
    (25, "Yara", 360),
    (26, "Zack", 340),
    (27, "Ava", 320),
    (28, "Ben", 300),
    (29, "Cody", 280),
    (30, "Dora", 260)
]

conn.executemany(
    "INSERT INTO customers VALUES (?, ?, ?)",
    customers
)

# -----------------------------
# SQL query: Top 10% customers
# -----------------------------
query = """
SELECT
    c1.customer_id,
    c1.customer_name,
    c1.spending
FROM customers c1
WHERE (
    SELECT COUNT(*)
    FROM customers c2
    WHERE c2.spending > c1.spending
) < (
    SELECT CAST(COUNT(*) * 0.10 + 0.9999 AS INTEGER)
    FROM customers
)
ORDER BY c1.spending DESC;
"""

# Execute query
df = pd.read_sql(query, conn)

print(df)

   customer_id customer_name  spending
0            1         Alice       900
1            2           Bob       850
2            3         Carol       800

In [2]:
import sqlite3
import pandas as pd

# --------------------------------
# Create in-memory SQLite database
# --------------------------------
conn = sqlite3.connect(":memory:")

# Create products table
conn.execute("""
CREATE TABLE products (
    product_id INTEGER,
    category TEXT,
    product_name TEXT,
    sales INTEGER
)
""")

# Insert data: 2 categories, 30 products each
products = []

# Electronics category
for i in range(1, 31):
    products.append(
        (i, "Electronics", f"Electronics_Product_{i}", 1000 - i * 10)
    )

# Furniture category
for i in range(31, 61):
    products.append(
        (i, "Furniture", f"Furniture_Product_{i}", 900 - (i - 30) * 10)
    )

conn.executemany(
    "INSERT INTO products VALUES (?, ?, ?, ?)",
    products
)

# --------------------------------
# SQL query: Top 10% products per category
# --------------------------------
query = """
SELECT
    p1.category,
    p1.product_name,
    p1.sales
FROM products p1
WHERE (
    SELECT COUNT(*)
    FROM products p2
    WHERE p2.category = p1.category
      AND p2.sales > p1.sales
) < (
    SELECT CAST(COUNT(*) * 0.10 + 0.9999 AS INTEGER)
    FROM products p3
    WHERE p3.category = p1.category
)
ORDER BY p1.category, p1.sales DESC;
"""

# Execute query
df = pd.read_sql(query, conn)

print(df)

      category           product_name  sales
0  Electronics  Electronics_Product_1    990
1  Electronics  Electronics_Product_2    980
2  Electronics  Electronics_Product_3    970
3    Furniture   Furniture_Product_31    890
4    Furniture   Furniture_Product_32    880
5    Furniture   Furniture_Product_33    870

In [3]:
# | COUNT(*) * 0.10 | +0.9999 | CAST → integer | Result            |
# | --------------- | ------- | -------------- | ----------------- |
# | 0.3             | 1.2999  | 1              | ✅ at least 1 row  |
# | 3.0             | 3.9999  | 3              | ✅ correct top 10% |
# | 12.5            | 13.4999 | 13             | ✅ rounds up       |